bkp/app/controllers/api/v1/products_controller.rb

SELECT "products".* FROM "products"
---
	def index
		products = Product.all

SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", 1]]
---
	def show
		product = Product.find(params[:id])