app/controllers/products_controller.rb

	def index
		products = Product.all
---
SELECT "products".* FROM "products"

	def show
		product = Product.find(params[:id])
---
SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", 0]]

	def create
		product = Product.new(product_params)
		if product.save
---
INSERT INTO "products" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "ArmyGlove"], ["created_at", "2015-06-07 10:56:01.572075"], ["updated_at", "2015-06-07 10:56:01.572075"]]